hieunguyen3092003/STM32LAB3/STM32Lab3/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BUTTON1_Pin GPIO_PIN_13
#define BUTTON1_GPIO_Port GPIOC
#define RED_LED1_Pin GPIO_PIN_2
#define RED_LED1_GPIO_Port GPIOA
#define GREEN_LED1_Pin GPIO_PIN_3
#define GREEN_LED1_GPIO_Port GPIOA
#define YELLOW_LED1_Pin GPIO_PIN_4
#define YELLOW_LED1_GPIO_Port GPIOA
#define RED_LED_Pin GPIO_PIN_5
#define RED_LED_GPIO_Port GPIOA
#define GREEN_LED_Pin GPIO_PIN_6
#define GREEN_LED_GPIO_Port GPIOA
#define YELLOW_LED_Pin GPIO_PIN_7
#define YELLOW_LED_GPIO_Port GPIOA
#define A_LED_Pin GPIO_PIN_0
#define A_LED_GPIO_Port GPIOB
#define B_LED_Pin GPIO_PIN_1
#define B_LED_GPIO_Port GPIOB
#define C_LED_Pin GPIO_PIN_2
#define C_LED_GPIO_Port GPIOB
#define EN0_Pin GPIO_PIN_8
#define EN0_GPIO_Port GPIOA
#define EN1_Pin GPIO_PIN_9
#define EN1_GPIO_Port GPIOA
#define EN2_Pin GPIO_PIN_10
#define EN2_GPIO_Port GPIOA
#define EN3_Pin GPIO_PIN_11
#define EN3_GPIO_Port GPIOA
#define BUTTON2_Pin GPIO_PIN_14
#define BUTTON2_GPIO_Port GPIOA
#define BUTTON3_Pin GPIO_PIN_15
#define BUTTON3_GPIO_Port GPIOA
#define D_LED_Pin GPIO_PIN_3
#define D_LED_GPIO_Port GPIOB
#define E_LED_Pin GPIO_PIN_4
#define E_LED_GPIO_Port GPIOB
#define F_LED_Pin GPIO_PIN_5
#define F_LED_GPIO_Port GPIOB
#define G_LED_Pin GPIO_PIN_6
#define G_LED_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
